; domain
(define (domain espresso)
  (:requirements :strips :typing)
  
  (:types
    location object container part number degree time tool cups o_type
  )
  
  (:predicates

    (at_container ?obj - object ?con - container)
    (at ?con - container ?loc - location)
    (agent_at ?loc - location)
    (carrying ?con - container)
    (add_to ?obj - object ?p - part )
    (open_container ?con - container)
    (open_part ?p - part)
    (level_off ?obj - object ?tool - tool)
    (cup_at ?c - cups ?loc - location)
    (coffee_at_cups ?obj - object ?c - cups)
    (all_together)
    (object_type ?obj - object ?t - o_type)
    (extract_with ?obj - object ?tool - tool)
    
    (turns_completed ?turns - number)
    (set_degree ?d - degree)
    (for_seconds ?time - time)
    (extracting)
    (closed)
    
    (all_parts_opened)
    
    (moka_closed)
    (moka_not_closed)
    
    (part_opened)
    (leveling)
    (container_closed)
    
    (water_in_machine)
    
    (filter_in_machine)
    (filter_not_in_machine)
    
    (all_in_machine)
    (all_not_in_machine)
    (at_grinder)
    (on_stove)
    (set_heat)
    
    (be_ready)

  )
  
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and (agent_at ?from)(closed))
    :effect (and (not (agent_at ?from)) (agent_at ?to))
  )

  (:action open
    :parameters (?loc - location ?con - container )
    :precondition (and (agent_at ?loc) (at ?con ?loc) (closed))
    :effect (not(closed))
  )

  (:action pick_up
    :parameters (?con - container ?loc - location)
    :precondition (and (agent_at ?loc) (at ?con ?loc) (not(carrying ?con))(not(closed)))
    :effect (carrying ?con)
  )
  
  (:action close
    :parameters (?loc - location ?con - container )
    :precondition (and (agent_at ?loc) (at ?con ?loc) (carrying ?con) (not(closed)))
    :effect (closed)
  )

  (:action put_down
    :parameters (?con - container ?loc - location)
    :precondition (and (agent_at ?loc)(not (at ?con ?loc))(carrying ?con)(closed))
    :effect (and (at ?con ?loc) (not (carrying ?con)))
  )
  
  (:action all_together
    :parameters ()
    :precondition (and
      (at coffee_container target_location)
      (at water_glass target_location)
      (at milk_container target_location)
      (at sugar_container target_location)
    )
    :effect (all_together)
  )
  
  (:action screw_moka_pod
    :parameters (?turns - number)
    :precondition (and (all_together) (moka_closed))
    :effect (and (moka_not_closed) (not (moka_closed)) (turns_completed ?turns))
  )
  
  (:action open_container
    :parameters (?con - container)
    :precondition (and (not(open_container ?con)) (moka_not_closed)(not(part_opened)))
    :effect (and (open_container ?con)(not(container_closed)))
  )
  
  
  (:action open_part
    :parameters (?p - part)
    :precondition (and(moka_not_closed) (not(container_closed)) (not(open_part ?p)))
    :effect (and (open_part ?p)(part_opened))
  )
  
  (:action pour_from_to
      :parameters (?coffee - object ?from - container ?to - container)
      :precondition (and (at_container ?coffee ?from)(moka_not_closed)(not(part_opened))(not(container_closed))(object_type ?coffee beans ))
      :effect (and
          (object_type ?coffee beans)
          (at_container ?coffee ?to) (at_grinder)
      )
  )
  
  (:action grind
      :parameters (?coffee - object)
      :precondition (and (moka_not_closed)(not(part_opened))(not(container_closed))(object_type ?coffee beans )(at_grinder))
      :effect (and (object_type ?coffee not_beans)(not(object_type ?coffee beans))(not(extracting)))
  )
  
  (:action extract
      :parameters (?coffee - object ?tool - tool)
      :precondition (and (moka_not_closed)(add_to filter bottom_chamber)(add_to water bottom_reservoir)(all_parts_opened)(not(container_closed))(object_type ?coffee not_beans)(at_grinder))
      :effect (and (extract_with ?coffee ?tool)
          (not (at_grinder))
      )
  )
  
   (:action all_parts_opened
    :parameters ()
    :precondition (and
      (object_type coffee not_beans)
      (open_part  bottom_chamber)
      (open_part bottom_reservoir)
    )
    :effect (all_parts_opened)
  )
  
  (:action put_in_machine
      :parameters (?obj - object ?p - part)
      :precondition (and (all_parts_opened)(moka_not_closed)(not(container_closed)))
      :effect (add_to ?obj ?p)
  )
  
  (:action all_in_machine
    :parameters ()
    :precondition (and
      (add_to water bottom_reservoir)
      (add_to filter bottom_chamber)
      (extract_with coffee spoon)
      (add_to coffee filter)
    )
    :effect (all_in_machine)
  )
  
  (:action close_containers
    :parameters ()
    :precondition (and (moka_not_closed)(leveling)(not(container_closed)))
    :effect (container_closed)
  )
  
  (:action leveling
      :parameters (?obj - object ?tool - tool)
      :precondition (and(all_in_machine))
      :effect (level_off ?obj ?tool)
  )
  
  (:action level_off
      :parameters ()
      :precondition (level_off coffee spoon)
      :effect (leveling)
  )
  
  (:action close_part
      :parameters (?p - part)
      :precondition (and (open_part ?p)(container_closed)(moka_not_closed)(part_opened))
      :effect (not(open_part ?p))
  )
  
  (:action all_parts_closed
      :parameters ()
      :precondition (and 
      (not(open_part bottom_reservoir))
      (not(open_part bottom_chamber))
    )
      :effect (not (part_opened))
  )
  
  (:action unscrew_moka_pod
      :parameters (?turns - number)
      :precondition (and (moka_not_closed) (not(part_opened)))
      :effect (and (moka_closed)(not(moka_not_closed))(turns_completed ?turns))
  )
  
  (:action put_on_stove
      :parameters ()
      :precondition (and (all_in_machine)(moka_closed)(not(on_stove)))
      :effect (and(on_stove)
      )
  )
  
  (:action set_heat
      :parameters (?d - degree)
      :precondition (and (on_stove)(not(set_heat)))
      :effect (and
          (set_degree ?d)
          (set_heat)
      )
  )
  
  (:action wait
      :parameters (?time - time)
      :precondition (and (set_heat)(not(be_ready)))
      :effect (and (for_seconds ?time)
          (be_ready)
      )
  )
  
  
  (:action pour_to
      :parameters (?obj - object ?c - cups)
      :precondition (and(be_ready)(moka_not_closed))
      :effect (coffee_at_cups ?obj ?c)
  )
  
    

)

; problem
(define (problem espresso_problem)
  (:domain espresso)
  
  (:objects
    coffee water milk sugar filter ready_coffee - object
    closet1 water_tap closet3 closet4 target_location start_location - location
    coffee_container water_glass milk_container  sugar_container grinder - container
    bottom_reservoir bottom_chamber filter - part
    spoon - tool
    cup_red cup_blue - cups
    beans not_beans - o_type
    three_times - number
    medium - degree
    five_seconds - time
  )
  
  (:init
    (at coffee_container closet1)
    (at water_glass water_tap)
    (at milk_container closet3)
    (at sugar_container closet4)
    (agent_at start_location)
    
    (at_container coffee coffee_container)
    (at_container water water_glass)
    (at_container sugar sugar_container)
    (at_container milk milk_container)
    
    (object_type coffee beans)
    (object_type milk not_beans)
    (object_type water not_beans)
    (object_type sugar not_beans)

    
    (closed)
    (moka_closed)
    (container_closed)
    (all_not_in_machine)

  )
  
  (:goal
    (and (all_together)
    (level_off coffee spoon)
    (open_container coffee_container)
    (all_in_machine)
    (coffee_at_cups ready_coffee cup_red)
    (coffee_at_cups ready_coffee cup_blue)
    )
  )
)

; plan
1. (move start_location closet3)
   deleted: (agent_at start_location)
   added: (agent_at closet3)
   goals met: 0 of 6
2. (open closet3 milk_container)
   deleted: (closed)
   goals met: 0 of 6
3. (pick_up milk_container closet3)
   added: (carrying milk_container)
   goals met: 0 of 6
4. (close closet3 milk_container)
   added: (closed)
   goals met: 0 of 6
5. (move closet3 target_location)
   deleted: (agent_at closet3)
   added: (agent_at target_location)
   goals met: 0 of 6
6. (put_down milk_container target_location)
   deleted: (carrying milk_container)
   added: (at milk_container target_location)
   goals met: 0 of 6
7. (move target_location closet4)
   deleted: (agent_at target_location)
   added: (agent_at closet4)
   goals met: 0 of 6
8. (open closet4 sugar_container)
   deleted: (closed)
   goals met: 0 of 6
9. (pick_up sugar_container closet4)
   added: (carrying sugar_container)
   goals met: 0 of 6
10. (close closet4 sugar_container)
   added: (closed)
   goals met: 0 of 6
11. (move closet4 target_location)
   deleted: (agent_at closet4)
   added: (agent_at target_location)
   goals met: 0 of 6
12. (put_down sugar_container target_location)
   deleted: (carrying sugar_container)
   added: (at sugar_container target_location)
   goals met: 0 of 6
13. (move target_location water_tap)
   deleted: (agent_at target_location)
   added: (agent_at water_tap)
   goals met: 0 of 6
14. (open water_tap water_glass)
   deleted: (closed)
   goals met: 0 of 6
15. (pick_up water_glass water_tap)
   added: (carrying water_glass)
   goals met: 0 of 6
16. (close water_tap water_glass)
   added: (closed)
   goals met: 0 of 6
17. (move water_tap target_location)
   deleted: (agent_at water_tap)
   added: (agent_at target_location)
   goals met: 0 of 6
18. (put_down water_glass target_location)
   deleted: (carrying water_glass)
   added: (at water_glass target_location)
   goals met: 0 of 6
19. (move target_location closet1)
   deleted: (agent_at target_location)
   added: (agent_at closet1)
   goals met: 0 of 6
20. (open closet1 coffee_container)
   deleted: (closed)
   goals met: 0 of 6
21. (pick_up coffee_container closet1)
   added: (carrying coffee_container)
   goals met: 0 of 6
22. (close closet1 coffee_container)
   added: (closed)
   goals met: 0 of 6
23. (move closet1 target_location)
   deleted: (agent_at closet1)
   added: (agent_at target_location)
   goals met: 0 of 6
24. (put_down coffee_container target_location)
   deleted: (carrying coffee_container)
   added: (at coffee_container target_location)
   goals met: 0 of 6
25. (all_together)
   added: (all_together)
   goals met: 1 of 6
26. (screw_moka_pod three_times)
   deleted: (moka_closed)
   added: (moka_not_closed) (turns_completed three_times)
   goals met: 1 of 6
27. (open_container coffee_container)
   deleted: (container_closed)
   added: (open_container coffee_container)
   goals met: 2 of 6
28. (pour_from_to coffee coffee_container grinder)
   added: (at_container coffee grinder) (at_grinder)
   goals met: 2 of 6
29. (grind coffee)
   deleted: (object_type coffee beans)
   added: (object_type coffee not_beans)
   goals met: 2 of 6
30. (open_part bottom_chamber)
   added: (open_part bottom_chamber) (part_opened)
   goals met: 2 of 6
31. (open_part bottom_reservoir)
   added: (open_part bottom_reservoir)
   goals met: 2 of 6
32. (all_parts_opened)
   added: (all_parts_opened)
   goals met: 2 of 6
33. (put_in_machine filter bottom_chamber)
   added: (add_to filter bottom_chamber)
   goals met: 2 of 6
34. (put_in_machine water bottom_reservoir)
   added: (add_to water bottom_reservoir)
   goals met: 2 of 6
35. (extract coffee spoon)
   deleted: (at_grinder)
   added: (extract_with coffee spoon)
   goals met: 2 of 6
36. (put_in_machine coffee filter)
   added: (add_to coffee filter)
   goals met: 2 of 6
37. (all_in_machine)
   added: (all_in_machine)
   goals met: 3 of 6
38. (leveling coffee spoon)
   added: (level_off coffee spoon)
   goals met: 4 of 6
39. (level_off)
   added: (leveling)
   goals met: 4 of 6
40. (close_containers)
   added: (container_closed)
   goals met: 4 of 6
41. (close_part bottom_chamber)
   deleted: (open_part bottom_chamber)
   goals met: 4 of 6
42. (close_part bottom_reservoir)
   deleted: (open_part bottom_reservoir)
   goals met: 4 of 6
43. (all_parts_closed)
   deleted: (part_opened)
   goals met: 4 of 6
44. (unscrew_moka_pod three_times)
   deleted: (moka_not_closed)
   added: (moka_closed)
   goals met: 4 of 6
45. (put_on_stove)
   added: (on_stove)
   goals met: 4 of 6
46. (set_heat medium)
   added: (set_degree medium) (set_heat)
   goals met: 4 of 6
47. (wait five_seconds)
   added: (for_seconds five_seconds) (be_ready)
   goals met: 4 of 6
48. (screw_moka_pod three_times)
   deleted: (moka_closed)
   added: (moka_not_closed)
   goals met: 4 of 6
49. (pour_to ready_coffee cup_blue)
   added: (coffee_at_cups ready_coffee cup_blue)
   goals met: 5 of 6
50. (pour_to ready_coffee cup_red)
   added: (coffee_at_cups ready_coffee cup_red)
   goals met: 6 of 6
